# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Andreas\Dropbox\Eigene Dokumente\Uni\VR Projekt\freeDSPPSoC-I2C\Design01.cydsn\Design01.cyprj
# Date: Tue, 10 May 2016 10:13:30 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyBUS_CLK(fixed-function)} -period 41.666666666666664 -waveform {0 20.8333333333333} [get_pins {ClockBlock/clk_bus_glb_ff}]


# Component constraints for C:\Users\Andreas\Dropbox\Eigene Dokumente\Uni\VR Projekt\freeDSPPSoC-I2C\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Andreas\Dropbox\Eigene Dokumente\Uni\VR Projekt\freeDSPPSoC-I2C\Design01.cydsn\Design01.cyprj
# Date: Tue, 10 May 2016 10:13:18 GMT
