# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Lukas Creutzburg\Google Drive\Virtuelle Realitaeten\PSoCWorkspace\VRProject\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Wed, 20 Apr 2016 16:13:47 GMT
#set_units -time ns
create_clock -name {I2C_Slave_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 62.5 -waveform {0 15.625} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_Slave_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 21 41} [list]


# Component constraints for C:\Users\Lukas Creutzburg\Google Drive\Virtuelle Realitaeten\PSoCWorkspace\VRProject\Bootloader_PSoC4_Example01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Lukas Creutzburg\Google Drive\Virtuelle Realitaeten\PSoCWorkspace\VRProject\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Wed, 20 Apr 2016 16:13:45 GMT
